<script setup>
  const resume = await useApi().find('resumes')
  console.log('resume', resume)

  const myWay = [
    {
      title: 'Создаю первый сайт',
      date: '2010',
      description: `31 августа создаю свой первый сайт, на популярной в той момент платформе «ucoz». С этого момента сайтостроение становится моим любимым хобби`,
    },
    {
      title: 'Изучаю HTML и CSS',
      date: '2010-2012',
      description: `Перерисовываю шаблоны из готовой библиотеки всё того же «ucoz». Сначала просто перерисовываю графику и добавляю новые элементы в Paint Net, потом начинаю изучать CSS, шаг за шагом узнавая как, что и за что отвечает. А ещё пробую работать копирайтером (опыт успешный, но не очень долгий)`,
    },
    {
      title: 'PHP, jQuery, WordpPress и SEO',
      date: '2012-2015',
      description: `Изучать курсы популярных авторов (некоторые бы лучше не смотрел, но всё же). Сайты остаются для меня хоть и любимым, но хобби. Хотя багаж знаний потихоньку растёт. Делаю свои плагины для WordPress. Создаю собственные шаблоны для WP, в какой-то момент становлюсь своего рода CSS художником.<br><br>
      Делаю WordpPress блоги с авторским контентом. Изучаю SEO оптимизацию, применяю свои знания на практике`,
    },
    {
      title: 'API, собственная CMS, фриланс',
      date: '2015-2017',
      description: `Появляются первые коммерческие заказы. Огромный интерес вызывает работа с API ВКонтакте. Делаю парсер номеров, который собирает несколько миллионов связок имя+телефон<br><br>
      На голом PHP создаю что-то смежное между CMS и фреймворком. Начинаю делать свои библиотеки в js/css (до паблика они так и не дошли)`,
    },
    {
      title: 'Динамические обложки во ВКонтакте',
      date: '2017-2018',
      description: `На волне хайпа создаю свою систему для прорисовки и загрузки динамических обложек для VK на PHP. Система включает в себя механизм прорисовки обложек, работу с API VK, Яндекс и сервисов поменьше для получения различной информации. Работаю с дизайнерами, учавствую в разработке обложки <b>для фестиваля АльфаБанка</b>`,
    },
    {
      title: 'Дизайнер',
      date: '2018-2019',
      description: `Ненадолго оставив программирование, начинаю работать дизайнером (тоже фриланс). Делаю дизайны как под динамические обложки, так и общее оформление соц.сетей. Рисую лендинги, интернет-магазины. Изучаю тренды в веб-дизайне, которые потом помогут мне при front-end разработке`,
    },
    {
      title: 'Laravel',
      date: '2019-2020',
      description: `Появляются клиенты на более крупные проекты, для которых готовые CMS уже не подходят. И написание своего кода с нуля уже кажется архаизмом. Так узнаю про фреймворк Laravel. Делаю первые проекты на нём. Начинаю работу над собственной панелью управление. Исключаю jQuery из жизни за ненадобностью`,
    },
    {
      title: 'Vue.js, разработка сайтов и ботов',
      date: '2020 — н.в.',
      description: `Делаю коммерческие проекты на laravel + vue.js, верстаю сайты, изучаю новые технологии и их способы применения в последующих проектах. Работаю в комманде с другими разработчиками, дорабатываю собственную панель управления на vue.`,
    },
  ]
</script>

<template>
  <div>
    <div class="pretitle">Long story...</div>
    <div class="title">Мой опыт</div>

    <div class="flex">
      <div class="w-2 rounded-lg bg-gray-950 shadow-xl shadow-gray-800"></div>
      <div class="ml-9 grid gap-10 w-full">
        <Box v-for="item in resume" :key="item.id">
          <div class="date mb-5">
            {{ item.attributes.period }}
          </div>
          <div
            class="text-sm leading-6 text-gray-400 max-w-lg"
            v-html="item.attributes.text"
          ></div>
        </Box>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
  .bg-box {
    overflow: visible;
    &::before {
      content: '';
      @apply absolute top-9 left-0 h-2 w-10 bg-gray-950 -translate-x-full;
    }
    &::after {
      content: '';

      @apply absolute top-9 -left-16 ml-2 -mt-3  w-8 h-8;
      @apply rounded-full bg-gray-900 border-8 border-gray-950;
      @apply transition-colors duration-300 scale-75;
    }
    .date {
      @apply text-xs text-white font-head transition-colors;
    }
    &:hover {
      &::after {
        @apply bg-primary-700;
      }
      .date {
        @apply text-primary-600;
      }
    }
  }
</style>
